testing-scripts/test_multi-client_encrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0____clients-requests_1/1/result.txt
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 19.70ms, 50.76 req/s, 48.43MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 976.94KB (1000382) total, 12B (12) headers (space savings 87.23%), 976.56KB (1000000) data
UDP datagram: 20 sent, 826 received
                     min         max         mean         sd        +/- sd
time for request:    14.47ms     14.47ms     14.47ms         0us   100.00%
time for connect:     4.85ms      4.85ms      4.85ms         0us   100.00%
time to 1st byte:     5.87ms      5.87ms      5.87ms         0us   100.00%
req/s           :      51.47       51.47       51.47        0.00   100.00%